cases/compressible/k_matched/interpolatingSolidBody/system/functions/residuals
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

residuals
{
     type            residuals;
     libs            ("libutilityFunctionObjects.so");

     writeControl    adjustableRunTime;
     writeInterval   1e-3;

     fields (p U h k omega);
}
// ************************************************************************* //
