cases/compressible/k_matched/interpolatingSolidBody/system/functions/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

yPlus
{
    libs            ("libfieldFunctionObjects.so");
    type            yPlus;
    writeControl    adjustableRunTime;
    writeInterval   1e-3;
}

// ************************************************************************* //
